class Reg(object):
    # 手机号（简单）
    REGEX_MOBILE_SIMPLE = "^[1]\\d{10}$"

    # 手机号（精确）
    # 移动：134(0-8)、135、136、137、138、139、147、150、151、152、157、158、159、178、182、183、184、187、188
    # 联通：130、131、132、145、155、156、175、176、185、186
    # 电信：133、153、173、177、180、181、189
    # 全球星：1349
    # 虚拟运营商：170
    REGEX_MOBILE_EXACT = "^((13[0-9])|(14[5,7])|(15[0-3,5-9])|(17[0,3,5-8])|(18[0-9])|(147))\\d{8}$"

    # 电话号码
    REGEX_TEL = "^0\\d{2,3}[- ]?\\d{7,8}"

    # 身份证号码15位
    REGEX_ID_CARD15 = "^[1-9]\\d{7}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{3}$"

    # 身份证号码18位
    REGEX_ID_CARD18 = "^[1-9]\\d{5}[1-9]\\d{3}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{3}([0-9Xx])$"

    # 邮箱
    REGEX_EMAIL = "^\\w+([-+.]\\w+)*@\\w+([-.]\\w+)*\\.\\w+([-.]\\w+)*$"

    # URL
    REGEX_URL = "[a-zA-z]+://[^\\s]*"

    # 汉字
    REGEX_ZH = "^[\\u4e00-\\u9fa5]+$"

    # 用户名，取值范围为a-z,A-Z,0-9,"_",汉字，不能以"_"结尾,用户名必须是6-20位
    REGEX_USERNAME = "^[\\w\\u4e00-\\u9fa5]{6,20}(?<!_)$"

    # yyyy-MM-dd格式的日期校验，已考虑平闰年
    REGEX_DATE = "^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$"

    # IP地址
    REGEX_IP = "((2[0-4]\\d|25[0-5]|[01]?\\d\\d?)\\.){3}(2[0-4]\\d|25[0-5]|[01]?\\d\\d?)"

    # 双字节字符(包括汉字在内)
    REGEX_DOUBLE_BYTE_CHAR = "[^\\x00-\\xff]"

    # 空白行
    REGEX_BLANK_LINE = "\\n\\s*\\r"

    # QQ号
    REGEX_TENCENT_NUM = "[1-9][0-9]{4,}"

    # 中国邮政编码
    REGEX_ZIP_CODE = "[1-9]\\d{5}(?!\\d)"

    # 正整数
    REGEX_POSITIVE_INTEGER = "^[1-9]\\d*$"

    # 负整数
    REGEX_NEGATIVE_INTEGER = "^-[1-9]\\d*$"

    # 整数
    REGEX_INTEGER = "^-?[1-9]\\d*$"

    # 非负整数(正整数 + 0)
    REGEX_NOT_NEGATIVE_INTEGER = "^[1-9]\\d*|0$"

    # 非正整数（负整数 + 0）
    REGEX_NOT_POSITIVE_INTEGER = "^-[1-9]\\d*|0$"

    # 正浮点数
    REGEX_POSITIVE_FLOAT = "^[1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*$"

    # 负浮点数
    REGEX_NEGATIVE_FLOAT = "^-[1-9]\\d*\\.\\d*|-0\\.\\d*[1-9]\\d*$"


if __name__ == "__main__":
    print(Reg.REGEX_NEGATIVE_FLOAT)
